/*
Реализуйте функцию truncate(), которая обрезает переданную строку до указанного количества символов,
добавляет в конце многоточие и возвращает получившуюся строку.
Подобная логика часто используется на сайтах, чтобы отобразить длинный текст в сокращенном виде.

Функция принимает два параметра:

Строка, которую нужно обрезать
Число символов, которые нужно оставить
// В функцию могут быть переданы в качестве параметров
// любая строка и любое количество символов

// Обрезаем текст 'hexlet', оставляя 2 символа
truncate('hexlet', 2); // "he..."

// Обрезаем текст 'it works!', оставляя 4 символа
truncate('it works!', 4); // 'it w...'

// Обрезаем текст 'hello', оставляя 3 символа
truncate('hello', 3); // 'hel...'
Подсказки
Вам нужно самостоятельно реализовать функцию truncate(), в JS такой функции не существует.
Реализовать эту функцию можно различными способами, подскажем лишь один из них. Для решения этим способом
 вам понадобится взять подстроку из строки, переданной первым параметром в функцию. Используйте для этого метод slice().
  Подумайте, исходя из задания, с какого индекса и по какой вам надо извлечь подстроку?
const word = 'welcome';
// Передавать параметры в метод можно через переменные
const index = 3;
word.slice(0, index); // "wel"
С точки зрения проверочной системы не имеет значения, каким из способов будет реализована функция truncate() внутри,
 главное – чтобы она выполняла поставленную задачу

Вам не нужно задавать конкретные значения для параметров, они будут переданы в функцию во время её тестирования.

Чтобы функция могла работать с любой строкой, используйте внутри функции переменные – параметры функции.
 После вызова функции эти переменные примут конкретные значения. Так функция сможет обрезать любую строку, которую мы передадим ей при вызове
 */

/*
const truncate = (text, pos) => {
    const text_slice = text.slice(0, pos);
    return `${text_slice}...`;

};
*/


const truncate = (text, pos) => {
    return `${text.slice(0, pos)}...`;
}

const message = truncate('hexlet', 2);
console.log(message);